{
    "members": [
        {
            "slug": "samer",
            "name": "samer el jammal",
            "role": "Co-Founder / Managing Partner",
            "image": "https://www.knsproperty.com/frontend/assets/images/samar.jpg",
            "about": "A banker & Telecom specialist, Sam soon discovered after returning back from Canada in 2008 a huge passion for property and worked his way to the top of the industry, weathering all of the market highs and lows. With over 14 years of experience in key senior management roles at large Dubai based Real Estate Developers he acquired an in depth understanding of Dubai real estate industry. His thorough managerial knowledge, roll your sleeves up attitude and hands on leadership led him along with his partner to Co-found K&S Properties LLC. Along with his co-founder, he is proud to have created a company where brokers are best positioned to fulfil all their potential while building long standing relationships with clients."
        },
        {
            "slug": "khaled",
            "name": "Khaled Al Kaabi",
            "role": "Co-Founder / Managing Partner",
            "image": "https://www.knsproperty.com/frontend/assets/images/khalid.jpg",
            "about": "Khaled began his career as a banker then soon realized the opportunities that the Real Estate market has to offer. In 2006 he changed career and became a specialist in property sales and management. With over 16 years of experience in sales and team management at large Dubai based Real Estate Developers; Khaled brings in a 360 degrees knowledge and experience of the Real Estate market. Khaled’s broad background and knowledge in off-plan and ready properties have helped many investors purchase their ideal investments and homes across Dubai. “My reputation is built on long term relationships with my clients; always delivering the highest quality of customer service and strive to help each of them find their dream home or ideal investment property in Dubai”."
        }
    ]
}